#include "GameIntro.h"

void page1()
{
	system("cls");
	pos(8, 4);	printf("【游　戏　背　景】");
	pos(8, 6);	printf("在《璀璨宝石》这款游戏中，你扮演文艺复兴时期的富商。你将使用你的资源获取矿脉，运输方");
	pos(8, 8);	printf("式，以及工匠。工匠可以帮你把宝石原料变成漂亮的宝珠。");

	pos(8, 11);	printf("【游　戏　过　程】");
	pos(8, 13);	printf("游戏过程中，玩家拿取宝石和黄金指。有了这些指示物，玩家可以购买有声望分数以及／或奖励");
	pos(8, 15);	printf("的发展卡。这些奖励让玩家接下来购买发展卡可以花比较少的宝石。当玩家有足够的奖励时，他");
	pos(8, 17);	printf("们立刻受到一位贵族访问（同样值声望分数）。在有玩家达到15声望分时的那回合，游戏结束，");
	pos(8, 19);	printf("最高分的玩家获胜。");
}

void page2()
{
	system("cls");
	pos(8, 4);	printf("【游　戏　物　件　说　明】");
	pos(8, 6);	printf(">>４０个指示物");
	pos(8, 8);
	{
		col(15); printf("a.●●●●●●●  ");
		col(9); printf("b.●●●●●●●  ");
		col(10); printf("c.●●●●●●●");
	}
	pos(8, 9);	col(7); printf("  钻　石（共7个）   蓝宝石（共7个）   绿宝石（共7个）");
	pos(8, 10);
	{
		col(12); printf("d.●●●●●●●  ");
		col(8); printf("e.●●●●●●●  ");
		col(6); printf("f.●●●●●");
	}
	pos(8, 11);	col(7); printf("  红宝石（共7个）   玛　瑙（共7个）   黄　金（共5个）");
	pos(8, 13);	printf(">>９０张发展卡（一级发展卡40张，二级发展卡30张，三级发展卡20张）");
	pos(8, 15);	printf("┌────────┐");
	pos(8, 16);	printf("│ "); col(8); printf("◆    "); col(7); printf("4│");
	pos(8, 17);	printf("│ "); col(10); printf("●"); col(7); printf("3 "); col(8); printf("●"); col(7); printf("3│");
	pos(8, 18);	printf("│ "); col(12); printf("●"); col(7); printf("6    │");
	pos(8, 19);	printf("└────────┘");
	pos(24, 15);	printf("为了赢得分数，玩家必须购买发展卡，这些卡片会展示在场中央，可以让所有");
	pos(24, 17);	printf("玩家在游戏过程中购买。游戏过程中，玩家可以保留发展卡到手上。手上保留");
	pos(24, 19);	printf("的发展卡只能被持有的玩家购买。");
	pos(8, 21);	printf("以这张卡为例：购买这张卡的玩家可以获得４分（右上角）。拥有这张卡可以让玩家获得一个黑");
	pos(8, 23);	printf("色的奖励（左上角）。要购买这张卡，玩家需花费３个绿宝石、６个红宝石，以及３个玛瑙。");
}

void page3()
{
	system("cls");
	pos(8, 4);	printf("【游　戏　物　件　说　明】");
	pos(8, 6);	printf(">>１０张贵族板块");
	pos(8, 8);	printf("┌──────── ┐");
	pos(8, 9);	printf("│ +3   "); col(10); printf("■"); col(7); printf("3│");
	pos(8, 10);	printf("│ "); col(9); printf("■"); col(7); printf("3  "); col(12); printf("■"); col(7); printf("3│");
	pos(8, 11);	printf("└──────── ┘");
	pos(24, 8);	printf("贵族板块展示在场中央。每回合结束时，如果该玩家有需求的足量奖励（也只");
	pos(24, 10);	printf("有奖励），他会自动受到贵族的来访，并获得对应的板块。");
	pos(24, 12);	printf("玩家不能拒绝贵族的来访。");
	pos(8, 14);	printf("获得一片贵族板块不算做是一个行动。每个贵族板块值３分，但玩家每回合只能获得一片。");
	pos(8, 16);	printf("以这张贵族板块为例：获得这片贵族板块的玩家获得３分，如果玩家有足够的发展卡，可以累计");
	pos(8, 18);	printf("３个蓝色奖励、３个绿色奖励，以及３个白色奖励，那么该玩家会自动获得该贵族的来访。");
}

void page4()
{
	system("cls");
	pos(8, 4);	printf("【游　戏　配　置】");
	pos(8, 6);	printf("游戏一开始将各自洗混每个等级的发展卡牌库，然后把它们按等级由下到上成列放置。");
	pos(8, 8);	printf("接着每个等级翻开４张卡片，置于桌面中间。洗混贵族板块，然后翻开玩家人数加一的板块片数。");
	pos(8, 10);	printf("（例如：４人游戏时翻开５片）。剩余的板块从游戏中移除，它们在游戏过程中不会用到。");
	pos(8, 12);	printf("６种指示物按颜色分类放置，置于桌面底部。");
	pos(8, 14);	printf(">>２或３人游戏");
	pos(8, 16);	printf("２人游戏：每种颜色的宝石指示物都各移除３个（各只会剩下４个宝石指示物）。黄金数量不变。");
	pos(8, 18);	printf("　　　　　翻开３片贵族板块。");
	pos(8, 20);	printf("３人游戏：每种颜色的宝石指示物都各移除２个（各只会剩下５个宝石指示物）。黄金数量不变。");
	pos(8, 22);	printf("　　　　　翻开４片贵族板块。");
}

void page5()
{
	system("cls");
	pos(8, 4);	printf("【游　戏　规　则】");
	pos(8, 6);	printf("以Player1为起始玩家。轮到玩家回合的时候，玩家必须选择以下３个行动之一：");
	pos(8, 8);	printf("——拿取３种不同颜色的宝石指示物，或拿取２个相同颜色的宝石指示物。后者只有在选定的宝");
	pos(8, 10);	printf("　　石至少有４个才能执行。");
	pos(8, 12);	printf("——保留一张发展卡并拿取一个黄金指示物（百搭）。");
	pos(8, 14);	printf("——从场中央购买１张发展卡，或购买１张之前保留的发展卡。");
	pos(8, 16);	printf(">>拿取宝石指示物");
	pos(8, 18);	printf("玩家在回合结束时，不能拥有超过10个指示物（包含百搭指示物）。如果这种情况发生，玩家必");
	pos(8, 20);	printf("须把多的指示物放回供应区。玩家可以放回所有或一部分其刚拿取的宝石。玩家拥有的宝石是公");
	pos(8, 22);	printf("开信息。");
	pos(8, 24);	printf("提示：如果特定颜色的宝石少于４个，玩家不能拿取２个该颜色的宝石。");
}

void page6()
{
	system("cls");
	pos(8, 4);	printf("【游　戏　规　则】");
	pos(8, 6);	printf(">>购入发展卡");
	pos(8, 8);	printf("为了购买一张发展卡，玩家必须花费发展卡上指定数量的宝石。黄金可以取代任何颜色的宝石。花");
	pos(8, 10);	printf("掉的宝石（包含任何黄金）都要放回场中央。");
	pos(8, 12);	printf("玩家可以购买场中央一张发展卡，或者玩家手中一张之前回合所保留的卡片。");
	pos(8, 14);	printf("每个玩家所购买的发展卡之奖励及声望分数将被计入玩家面板中。");
	pos(8, 16);	printf("重要：当场中有发展卡被购买或保留后，必须补上相同等级的卡片。");
	pos(8, 18);	printf("　　　游戏的任何时刻里，每个等级都必须有４张正面朝上的卡片（除非该等级的牌库已经空了，");
	pos(8, 20);	printf("　　　在这种情况下则不用补满４张）。");
}

void page7()
{
	system("cls");
	pos(8, 4);	printf("【游　戏　规　则】");
	pos(8, 6);	printf(">>保留发展卡");
	pos(8, 8);	printf("为了保留一张发展卡，玩家只需要拿取场中央一张正面朝上的发展卡。保留的发展卡不能弃掉。玩");
	pos(8, 10);	printf("家的手中不能保留超过三张发展卡，而且唯一能够去除发展卡的方式就是购买它。保留一张卡片也");
	pos(8, 12);	printf("是唯一能够获得黄金指示物（百搭）的方式。如果没有任何的黄金指示物可供拿取，你仍能够保留");
	pos(8, 14);	printf("一张发展卡，但不能拿取任何黄金。");
}

void page8()
{
	system("cls");
	pos(8, 4);	printf("【游　戏　规　则】");
	pos(8, 6);	printf(">>奖励");
	pos(8, 8);	printf("玩家从之前回合购买的发展卡上的奖励，可以提供购买新发展卡的折扣。每个特定颜色的奖励等于");
	pos(8, 10);	printf("该颜色的一个宝石。");
	pos(8, 12);	printf("因此假设：如果玩家有２个蓝色奖励，然后想要购买一张需要花费２个蓝宝石及１个绿宝石的卡片，");
	pos(8, 14);	printf("该玩家只需要花费１个绿宝石。如果玩家购买了足够多的发展卡（因此有很多的奖励），其甚至可");
	pos(8, 16);	printf("以不花任何宝石购买卡片。");
}

void page9()
{
	system("cls");
	pos(8, 4);	printf("【游　戏　规　则】");
	pos(8, 6);	printf(">>贵族");
	pos(8, 8);	printf("每个玩家回合结束时，查看贵族板块，以决定他们是否会收到贵族的来访。");
	pos(8, 10);	printf("如果玩家至少有贵族板上指定的奖励种类和数量，则玩家可以受到该贵族的来访。可以拒绝一个贵");
	pos(8, 12);	printf("族的来访，这不算做是一个行动。");
	pos(8, 14);	printf("如果玩家有足够的奖励，而且回合结束时受到多于一个贵族的来访，玩家可以选择要获得哪一个贵");
	pos(8, 16);	printf("族板块。");
	pos(8, 18);	printf(">>游戏结束");
	pos(8, 20);	printf("当有玩家获得15分时，玩家当轮，好让每个玩家有相同的回合数。");
	pos(8, 22);	printf("最高分的玩家获胜。");
	pos(8, 24);	printf("如果平手，购买最少发展卡的玩家获胜。");
}

void GameIntro()
{
	system("cls");
	int input = NULL;
	int nowPage = 1;

	page1();
	pos(8, 26);	printf("操作说明　【←/↑】：上一页　【→/↓】：下一页　【Esc】：返回标题界面");

	while (input != 27)	//Esc键
	{
		input = _getch();
		switch (input)
		{
		case 72:	//上方向键
		case 75:	//左方向键
			if (nowPage > 1)
				nowPage--;
			break;
		case 77:	//右方向键
		case 80:	//下方向键
			if (nowPage < 9)
				nowPage++;
			break;
		}
		switch (nowPage)
		{
		case 1:
			page1();
			pos(8, 26);	printf("操作说明　【←/↑】：上一页　【→/↓】：下一页　【Esc】：返回标题界面　第１页，共９页");
			break;
		case 2:
			page2();
			pos(8, 26);	printf("操作说明　【←/↑】：上一页　【→/↓】：下一页　【Esc】：返回标题界面　第２页，共９页");
			break;
		case 3:
			page3();
			pos(8, 26);	printf("操作说明　【←/↑】：上一页　【→/↓】：下一页　【Esc】：返回标题界面　第３页，共９页");
			break;
		case 4:
			page4();
			pos(8, 26);	printf("操作说明　【←/↑】：上一页　【→/↓】：下一页　【Esc】：返回标题界面　第４页，共９页");
			break;
		case 5:
			page5();
			pos(8, 26);	printf("操作说明　【←/↑】：上一页　【→/↓】：下一页　【Esc】：返回标题界面　第５页，共９页");
			break;
		case 6:
			page6();
			pos(8, 26);	printf("操作说明　【←/↑】：上一页　【→/↓】：下一页　【Esc】：返回标题界面　第６页，共９页");
			break;
		case 7:
			page7();
			pos(8, 26);	printf("操作说明　【←/↑】：上一页　【→/↓】：下一页　【Esc】：返回标题界面　第７页，共９页");
			break;
		case 8:
			page8();
			pos(8, 26);	printf("操作说明　【←/↑】：上一页　【→/↓】：下一页　【Esc】：返回标题界面　第８页，共９页");
			break;
		case 9:
			page9();
			pos(8, 26);	printf("操作说明　【←/↑】：上一页　【→/↓】：下一页　【Esc】：返回标题界面　第９页，共９页");
			break;
		}
	}
}